[
  {"id":"f1a2b3c4-d5e6-4789-a0bc-def123456789","appointmentId":null,"mascotaId":"a1b2c3d4-e5f6-7890-abcd-ef1234567890","medicoId":2,"fecha":"2024-01-15","hora":"10:30","sintomas":"Tos seca persistente, estornudos frecuentes, ligera secreción nasal","diagnostico":"Chequeo general de rutina. Mascota en buen estado de salud. Se detectó ligera irritación en vías respiratorias superiores, posiblemente por alergia estacional.","procedimientos":"Examen físico completo, auscultación cardiopulmonar, revisión de oídos y boca, palpación abdominal","tratamiento":"Antihistamínico canino 10mg cada 12 horas por 7 días, mantener hidratación adecuada","ordenes":"Control en 15 días si persisten los síntomas. Evitar exposición a ambientes con mucho polvo.","observaciones":"Peso: 15.2kg. Temperatura: 38.5°C. Frecuencia cardíaca: 95 lpm. Vacunas al día."},
  {"id":"f2a3b4c5-d6e7-4890-a1bc-def234567890","appointmentId":null,"mascotaId":"a1b2c3d4-e5f6-7890-abcd-ef1234567890","medicoId":2,"fecha":"2024-02-28","hora":"09:15","sintomas":"Control post-tratamiento. Propietario reporta mejoría completa.","diagnostico":"Resolución completa del cuadro alérgico. Vías respiratorias normales. Mascota completamente recuperada.","procedimientos":"Auscultación pulmonar, inspección de mucosas, revisión general","tratamiento":"No requiere tratamiento adicional. Suspender antihistamínico.","ordenes":"Mantener cuidados preventivos. Próximo control en 6 meses para chequeo de rutina.","observaciones":"Peso: 15.5kg. Temperatura: 38.3°C. Excelente evolución. Propietario muy satisfecho con la atención."},
  {"id":"f3a4b5c6-d7e8-4901-a2bc-def345678901","appointmentId":null,"mascotaId":"c3d4e5f6-a7b8-9012-cdef-123456789012","medicoId":2,"fecha":"2024-03-20","hora":"14:00","sintomas":"Cojera en pata trasera izquierda, dolor al apoyar, inflamación leve en articulación","diagnostico":"Esguince grado I en articulación tarsiana izquierda. Sin fractura. Posible traumatismo por actividad física intensa.","procedimientos":"Examen ortopédico, palpación de extremidades, pruebas de movilidad articular, radiografía de miembro posterior","tratamiento":"Carprofeno 50mg cada 12 horas por 5 días, reposo relativo, aplicar hielo local 3 veces al día por 15 minutos","ordenes":"Limitar actividad física por 2 semanas. Control en 7 días para evaluar evolución. Si empeora, acudir inmediatamente.","observaciones":"Peso: 22.3kg. Sin dolor a la palpación de otras articulaciones. Radiografía sin alteraciones óseas. Pronóstico favorable."},
  {"id":"f4a5b6c7-d8e9-4012-a3bc-def456789012","appointmentId":null,"mascotaId":"c3d4e5f6-a7b8-9012-cdef-123456789012","medicoId":2,"fecha":"2024-04-03","hora":"11:30","sintomas":"Control post-esguince. Propietario reporta recuperación total, sin cojera.","diagnostico":"Resolución completa del esguince. Articulación sin inflamación ni dolor. Movilidad normal recuperada.","procedimientos":"Examen ortopédico, pruebas de movilidad, palpación articular","tratamiento":"No requiere tratamiento. Alta médica.","ordenes":"Puede retomar actividad física gradualmente. Evitar saltos bruscos por 1 semana más.","observaciones":"Peso: 22.5kg. Excelente recuperación. Se recomienda mantener peso ideal para evitar sobrecarga articular."},
  {"id":"f5a6b7c8-d9e0-4123-a4bc-def567890123","appointmentId":null,"mascotaId":"b2c3d4e5-f6a7-8901-bcde-f12345678901","medicoId":3,"fecha":"2024-05-10","hora":"16:00","sintomas":"Estornudos frecuentes, secreción nasal y ocular bilateral, conjuntivitis leve, inapetencia parcial","diagnostico":"Rinotraqueítis viral felina (herpesvirus). Cuadro respiratorio superior leve-moderado. Sin complicaciones secundarias.","procedimientos":"Examen físico completo, evaluación de vías respiratorias, limpieza de secreciones, instilación de colirio","tratamiento":"Lisina 250mg cada 12 horas por 14 días, colirio oftálmico cada 6 horas, amoxicilina 50mg cada 12 horas por 7 días (prevención)","ordenes":"Aislar de otros gatos si los hay. Mantener hidratación. Alimento húmedo tibio para estimular apetito. Control en 5 días.","observaciones":"Peso: 4.2kg. Temperatura: 39.1°C. Sin distrés respiratorio. Pronóstico favorable. Enfermedad común y manejable."},
  {"id":"f6a7b8c9-d0e1-4234-a5bc-def678901234","appointmentId":null,"mascotaId":"b2c3d4e5-f6a7-8901-bcde-f12345678901","medicoId":3,"fecha":"2024-05-20","hora":"10:00","sintomas":"Control. Propietario reporta mejoría notable, menos estornudos, secreción disminuida.","diagnostico":"Evolución favorable del cuadro viral. Mejoría clínica evidente. Continuar tratamiento.","procedimientos":"Examen físico general, evaluación de vías respiratorias","tratamiento":"Continuar con lisina otros 7 días, suspender antibiótico, reducir frecuencia de colirio.","ordenes":"Control final en 1 semana. Completar tratamiento con lisina.","observaciones":"Peso: 4.3kg. Temperatura: 38.7°C. Buena evolución."},
  {"id":"f7a8b9c0-d1e2-4345-a6bc-def789012345","appointmentId":null,"mascotaId":"a7b8c9d0-e1f2-3456-1234-567890123456","medicoId":2,"fecha":"2024-06-05","hora":"15:30","sintomas":"Cojera leve en miembro posterior derecho, dificultad para levantarse después de descansar","diagnostico":"Displasia de cadera grado leve-moderado. Cambios degenerativos incipientes. Requiere manejo a largo plazo.","procedimientos":"Examen ortopédico completo, pruebas de dolor articular, radiografía de caderas, evaluación de masa muscular","tratamiento":"Condroprotectores (glucosamina + condroitina) diariamente, carprofeno 75mg cada 12 horas por 10 días, control de peso","ordenes":"Ejercicio moderado regular (natación ideal), evitar sobrepeso, suplementación permanente. Control cada 3 meses.","observaciones":"Peso: 35.0kg (ideal 32-33kg). Displasia conocida, ahora sintomática. Pronóstico bueno con manejo adecuado."},
  {"id":"f8a9b0c1-d2e3-4456-a7bc-def890123456","appointmentId":null,"mascotaId":"a7b8c9d0-e1f2-3456-1234-567890123456","medicoId":2,"fecha":"2024-09-10","hora":"09:30","sintomas":"Control trimestral. Propietario reporta mejoría con tratamiento, más activo, menos cojera.","diagnostico":"Displasia de cadera estable con tratamiento. Buena respuesta a condroprotectores. Continuar manejo.","procedimientos":"Examen ortopédico, evaluación de masa muscular, pesaje","tratamiento":"Continuar condroprotectores indefinidamente, carprofeno solo si hay brotes de dolor.","ordenes":"Mantener peso ideal, ejercicio regular, próximo control en 3 meses.","observaciones":"Peso: 33.5kg (excelente). Masa muscular mejorada. Propietario muy comprometido con cuidados."},
  {"id":"f9a0b1c2-d3e4-4567-a8bc-def901234567","appointmentId":null,"mascotaId":"e5f6a7b8-c9d0-1234-ef12-345678901234","medicoId":3,"fecha":"2024-07-01","hora":"11:00","sintomas":"Vómitos intermitentes, diarrea leve, inapetencia, ligero letargo","diagnostico":"Gastroenteritis aguda leve, posiblemente por indiscreción alimentaria. Sin deshidratación severa.","procedimientos":"Examen físico completo, palpación abdominal, evaluación de hidratación","tratamiento":"Metoclopramida gotas cada 8 horas por 3 días, dieta blanda (pollo y arroz) por 5 días, probióticos","ordenes":"Monitorear frecuencia de vómitos. Si persiste o empeora, regresar. Hidratación constante.","observaciones":"Peso: 10.2kg. Temperatura: 38.8°C. Cachorro curioso que come cosas del suelo."},
  {"id":"f0a1b2c3-d4e5-4678-a9bc-def012345678","appointmentId":null,"mascotaId":"d0e1f2a3-b4c5-6789-4567-890123456789","medicoId":2,"fecha":"2024-08-15","hora":"14:30","sintomas":"Sobrepeso evidente, letargo, dificultad para saltar, jadeo excesivo","diagnostico":"Obesidad grado II. Peso 6.2kg (ideal 4.5-5kg). Riesgo de diabetes y problemas articulares. Requiere plan de reducción de peso.","procedimientos":"Pesaje, evaluación de condición corporal, palpación abdominal, análisis de sangre (glucosa, perfil lipídico)","tratamiento":"Dieta hipocalórica específica para gatos, raciones controladas, incrementar actividad física con juegos","ordenes":"Reducir ingesta calórica 30%, NO dar premios extra. Control de peso mensual. Meta: perder 0.2kg por mes.","observaciones":"Peso: 6.2kg. Análisis: glucosa límite alto. Propietario confiesa dar muchos premios. Plan educativo sobre alimentación."},
  {"id":"f1a2b3c4-d5e6-4789-b0bc-def123456780","appointmentId":null,"mascotaId":"d0e1f2a3-b4c5-6789-4567-890123456789","medicoId":2,"fecha":"2024-10-15","hora":"10:00","sintomas":"Control de peso. Propietario reporta cumplimiento de dieta y más actividad.","diagnostico":"Progreso en reducción de peso. Pérdida de 0.4kg en 2 meses. Continuar con plan nutricional.","procedimientos":"Pesaje, evaluación de condición corporal","tratamiento":"Continuar dieta hipocalórica, mantener actividad física.","ordenes":"Objetivo: alcanzar 5.5kg en 2 meses más. Control mensual.","observaciones":"Peso: 5.8kg. Excelente progreso. Propietario motivado y comprometido."},
  {"id":"f2a3b4c5-d6e7-4890-b1bc-def234567891","appointmentId":null,"mascotaId":"d4e5f6a7-b8c9-0123-def1-234567890123","medicoId":3,"fecha":"2024-09-05","hora":"16:30","sintomas":"Pelo enmarañado con nudos severos, piel irritada debajo, mal olor, ligera dermatitis","diagnostico":"Dermatitis por falta de higiene y cuidado del pelaje. Nudos severos que causan tracción y malestar. Requiere rasurado parcial.","procedimientos":"Rasurado de zonas con nudos irrecuperables, baño medicado, aplicación de crema calmante, limpieza de piel","tratamiento":"Champú medicado semanal por 1 mes, cepillado diario obligatorio, omega 3 para salud del pelaje","ordenes":"Cepillado diario sin excepción. Baño cada 2 semanas. Control en 1 mes para evaluar crecimiento de pelo.","observaciones":"Peso: 5.5kg. Piel irritada en varias zonas. Se educa a propietario sobre cuidados de razas persas. Compromiso de cepillado diario."},
  {"id":"f3a4b5c6-d7e8-4901-c2bc-def345678902","appointmentId":null,"mascotaId":"ec86ccca-7ead-42d9-86e3-89367fcc0f56","medicoId":3,"fecha":"2024-10-05","hora":"11:00","sintomas":"Primera consulta. Propietario solicita chequeo general y asesoría sobre alimentación y vacunación.","diagnostico":"Gatita joven en excelente estado general. Primera valoración veterinaria. Peso adecuado para edad. Sin alteraciones físicas.","procedimientos":"Examen físico completo, revisión de mucosas, auscultación cardiopulmonar, palpación abdominal, revisión dental","tratamiento":"Aplicación de primera dosis de vacuna triple felina, desparasitación interna con fenbendazol","ordenes":"Regresar en 21 días para refuerzo de vacuna. Mantener desparasitación cada 3 meses. Alimentación balanceada específica para gatitos.","observaciones":"Peso: 5.0kg. Temperatura: 38.6°C. Carácter tranquilo. Se entrega cartilla de vacunación y calendario de próximas vacunas."},
  {"id":"f4a5b6c7-d8e9-4012-c3bc-def456789013","appointmentId":null,"mascotaId":"ec86ccca-7ead-42d9-86e3-89367fcc0f56","medicoId":3,"fecha":"2024-10-28","hora":"14:30","sintomas":"Control de vacunación. Propietaria reporta que Fifi está muy activa y comiendo bien.","diagnostico":"Excelente evolución. Gatita saludable. Aplicación de refuerzo de vacuna triple felina completada exitosamente.","procedimientos":"Examen físico de control, revisión de mucosas, aplicación de segunda dosis de vacuna triple felina","tratamiento":"Refuerzo de vacuna triple felina completado. Próxima vacuna: rabia en 1 mes.","ordenes":"Regresar en 1 mes para vacuna antirrábica. Continuar con alimentación balanceada. Próximo control en 3 meses.","observaciones":"Peso: 5.2kg. Temperatura: 38.5°C. Ganancia de peso adecuada. Propietaria muy comprometida con cuidados. Esquema de vacunación en curso."}
]